Table of Contents
 Class BimConnectionsSynchronizeEvent
Namespace
IdeaStatiCa.BimApiLink.Plugin
Assembly
IdeaStatiCa.BimApiLink.dll
BIM - connection synchronized event
public class BimConnectionsSynchronizeEvent : IdeaUserEventImplementation, IIdeaUserEvent
Inheritance
object
IdeaUserEventImplementation
BimConnectionsSynchronizeEvent
Implements
IIdeaUserEvent
Inherited Members
 IdeaUserEventImplementation.EventCategory
 IdeaUserEventImplementation.EventName
 IdeaUserEventImplementation.EventAction
 IdeaUserEventImplementation.EventLabel
 IdeaUserEventImplementation.EventValue
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 BimConnectionsSynchronizeEvent(string, string)
public BimConnectionsSynchronizeEvent(string bimAppName, string contryCode)
Parameters
bimAppName string
contryCode string
 Edit this page